### 1. 移除重複值

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':['a','a','a','b','b','c','d','e'],'col2':[1,1,2,2,3,3,4,5]})
df

  col1  col2
0    a     1
1    a     1
2    a     2
3    b     2
4    b     3
5    c     3
6    d     4
7    e     5

In [2]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [3]:
df.drop_duplicates()

  col1  col2
0    a     1
2    a     2
3    b     2
4    b     3
5    c     3
6    d     4
7    e     5

#### 針對所選column的duplicate值移除（預設會留下重複列的第一個）

In [4]:
df.drop_duplicates(['col1','col2'])

  col1  col2
0    a     1
2    a     2
3    b     2
4    b     3
5    c     3
6    d     4
7    e     5

In [5]:
df.drop_duplicates(['col1'])

  col1  col2
0    a     1
3    b     2
5    c     3
6    d     4
7    e     5

In [6]:
df.drop_duplicates(['col1']).reset_index(drop=True)

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4
4    e     5

#### 針對所選column的duplicate值移除（挑選重複列的最後一個）

In [7]:
df.drop_duplicates(['col1'], keep='last')

  col1  col2
2    a     2
4    b     3
5    c     3
6    d     4
7    e     5

### 2. 資料對應轉換（Mapping）

In [8]:
df = pd.DataFrame({'sex':['male','male','female','male','female','female']})
df

      sex
0    male
1    male
2  female
3    male
4  female
5  female

In [9]:
sex_to_boolean = {'female':0,'male':1} #dict
df['code'] = df['sex'].map(sex_to_boolean)
df

      sex  code
0    male     1
1    male     1
2  female     0
3    male     1
4  female     0
5  female     0

### 3. 資料取代

In [10]:
df = pd.DataFrame({'col1':['c01','c02','c03','c04','c05'],'col2':[65,'NULL','NaN','NaN',78],'col3':[321,34,'NULL','NaN',34]})
df

  col1  col2  col3
0  c01    65   321
1  c02  NULL    34
2  c03   NaN  NULL
3  c04   NaN   NaN
4  c05    78    34

In [11]:
df['col2'].replace('NaN',0)

0      65
1    NULL
2       0
3       0
4      78
Name: col2, dtype: object

In [12]:
df.replace('NaN',0)

  col1  col2  col3
0  c01    65   321
1  c02  NULL    34
2  c03     0  NULL
3  c04     0     0
4  c05    78    34

In [13]:
df.replace(['NaN','NULL'],0)

  col1  col2  col3
0  c01    65   321
1  c02     0    34
2  c03     0     0
3  c04     0     0
4  c05    78    34

In [14]:
df.replace({'NaN':0,'NULL':-1})  #dictionary

  col1  col2  col3
0  c01    65   321
1  c02    -1    34
2  c03     0    -1
3  c04     0     0
4  c05    78    34

### 4. 分箱、轉換

In [15]:
df = pd.DataFrame({'id':['s01','s02','s03','s04','s05'],'score':[74,59,98,84,60]})
df

    id  score
0  s01     74
1  s02     59
2  s03     98
3  s04     84
4  s05     60

In [16]:
bins = [0,60,70,80,90,100]
pd.cut(df['score'],bins)

0     (70, 80]
1      (0, 60]
2    (90, 100]
3     (80, 90]
4      (0, 60]
Name: score, dtype: category
Categories (5, object): [(0, 60] < (60, 70] < (70, 80] < (80, 90] < (90, 100]]

In [17]:
pd.cut(df['score'],bins, right=False)

0     [70, 80)
1      [0, 60)
2    [90, 100)
3     [80, 90)
4     [60, 70)
Name: score, dtype: category
Categories (5, object): [[0, 60) < [60, 70) < [70, 80) < [80, 90) < [90, 100)]

In [18]:
labels = ['F','D','C','B','A']
pd.cut(df['score'],bins, right=False, labels=labels)

0    C
1    F
2    A
3    B
4    D
Name: score, dtype: category
Categories (5, object): [F < D < C < B < A]

In [19]:
df['label'] = pd.cut(df['score'],bins, right=False, labels=labels)
df

    id  score label
0  s01     74     C
1  s02     59     F
2  s03     98     A
3  s04     84     B
4  s05     60     D

### 5. 遺失值（Missing Data）

In [50]:
import pandas as pd
df = pd.DataFrame({'col1':['a',float('NaN'),'a',None,'b','c','d','e'],'col2':[1,1,3,2,float('NaN'),3,4,5]})
df

   col1  col2
0     a   1.0
1   NaN   1.0
2     a   3.0
3  None   2.0
4     b   NaN
5     c   3.0
6     d   4.0
7     e   5.0

In [51]:
df['col1'].isnull()

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: col1, dtype: bool

In [52]:
df = df[df['col1'].notnull()]
df

  col1  col2
0    a   1.0
2    a   3.0
4    b   NaN
5    c   3.0
6    d   4.0
7    e   5.0

In [53]:
df = df[df['col2'].notnull()]
df

  col1  col2
0    a   1.0
2    a   3.0
5    c   3.0
6    d   4.0
7    e   5.0